[
  {
    "title": "Graphic & Web Design Intern",
    "organization": "IH Concepts",
    "slug": "ih-concepts-intern",
    "longSummary": "Contributed to the design and development of client-facing WordPress pages, building responsive blog, tutorial, and press templates while enhancing homepage styling. Created reusable PHP shortcodes, improved front-end accessibility and UX, and collaborated with design, marketing, and editorial teams. Gained hands-on experience in SEO, local search (MEO), and brand-focused content production for small and mid-sized businesses.",
    "responsibilities": [
      "Developed and styled WordPress pages using PHP, HTML, CSS, and JavaScript",
      "Created responsive templates for blog, tutorial, and press sections",
      "Implemented reusable PHP shortcodes and template parts for editors",
      "Modified and optimized front-end CSS for accessibility and UX",
      "Optimized images and assets to improve site load performance",
      "Assisted with graphic design, branding assets, and page layouts",
      "Collaborated with marketing and editorial teams on content strategy",
      "Wrote internal documentation and tutorials for client editors",
      "Supported basic SEO and MEO improvements across key pages",
      "Pages worked on include the homepage, blog, tutorials, and press releases"
    ],
    "tools": [
      "WordPress",
      "PHP",
      "HTML",
      "CSS/Sass",
      "JavaScript",
      "Figma",
      "SEO/MEO Tools"
    ],
    "image": "img/exp_gallery/ihc/ihc-blog.png",
    "gallery": [
      {
        "src": "./img/exp_gallery/ihc/ihc-home.png",
        "link": "https://ihconcepts.com/",
        "alt": "IH Concepts Homepage Layout"
      },
      {
        "src": "./img/exp_gallery/ihc/ihc-blog.png",
        "link": "https://ihconcepts.com/blog/",
        "alt": "IH Concepts Blog Template",
        "caption": "Blog Page"
      },
      {
        "src": "./img/exp_gallery/ihc/ihc-tutorials.png",
        "link": "https://ihconcepts.com/tutorials/",
        "alt": "IH Concepts Tutorials Template"
      },
      {
        "src": "./img/exp_gallery/ihc/ihc-press.png",
        "link": "https://ihconcepts.com/press/",
        "alt": "IH Concepts Press Page"
      }
    ],
    "dates": "Jun 2023 - Aug 2023",
    "links": ["https://ihconcepts.com/blog/"]
  },
  {
    "title": "Web Design Chair",
    "organization": "Lambda Phi Epsilon International Fraternity, Inc.",
    "slug": "lphie-web-design-chair",
    "longSummary": "Led the redesign of the chapter website to improve recruitment flow, highlight events, and present a more modern visual identity. Coordinated with chapter members to gather photos, copy, and updates, and maintained the site throughout the academic year.",
    "responsibilities": [
      "Led the redesign of the chapter website with a focus on recruitment and events",
      "Planned page structure and navigation for potential new members and alumni",
      "Coordinated content and assets (photos, copy, graphics) with chapter members",
      "Deployed responsive templates and updated styles using HTML, CSS, and JavaScript",
      "Maintained and updated the site each semester with new events and information"
    ],
    "tools": ["HTML", "CSS", "JavaScript"],
    "gallery": [
      {
        "src": "./img/exp_gallery/lphie-html-site.png",
        "link": "https://touxlor.github.io/646-Final-Project/",
        "alt": "IH Concepts Homepage Layout",
        "caption": "Web Page"
      }
    ],
    "dates": "Sep 2022 - May 2023",
    "links": []
  },
  {
    "title": "Web Designer",
    "organization": "Treasure Taste LLC",
    "slug": "treasure-taste-web-designer",
    "longSummary": "Designed and implemented a responsive website concept to showcase products, events, and brand story for a food-focused small business. Improved online discoverability and simplified order/booking flows with clear sections, hierarchy, and strong call-to-actions.",
    "responsibilities": [
      "Designed page layouts and responsive components for the homepage and menu",
      "Built accessible HTML/CSS pages and interactive UI with vanilla JavaScript",
      "Optimized images and assets for performance on mobile and low-bandwidth connections",
      "Worked with the owners to iterate on content, visual style, and calls-to-action"
    ],
    "tools": ["HTML", "CSS", "JavaScript", "Figma"],
    "gallery": [
      {
        "src": "./img/exp_gallery/treasure-taste-home.png",
        "pdf": "./img/pdfs/tt/Treasure-Taste.pdf",
        "alt": "IH Concepts Homepage Layout",
        "caption": "Figma Design Preview"
      }
    ],
    "dates": "Jan 2022 - Dec 2022",
    "links": []
  },
  {
    "title": "Graphic Designer",
    "organization": "Golden Flavors LLC",
    "slug": "golden-flavors-graphic-designer",
    "longSummary": "Produced branding and promotional artwork for product launches and events, including packaging mockups, social graphics, and print collateral. Collaborated with the marketing lead to refine the visual identity and ensure consistent brand language across channels.",
    "responsibilities": [
      "Created brand assets, logo variations, and packaging mockups for new products",
      "Designed promotional materials for markets, pop-ups, and social media campaigns",
      "Prepared print-ready files and coordinated with vendors for physical collateral"
    ],
    "tools": ["Adobe Illustrator", "Photoshop", "InDesign", "Figma"],
    "gallery": [
      {
        "src": "./img/exp_gallery/gf/gf-menu-one.png",
        "alt": "Golden Flavors branding case study",
        "pdf": "./img/pdfs/gf_pdf/gf_menu.pdf",
        "caption": "Menu Graphic 1"
      },
      {
        "src": "./img/exp_gallery/gf/gf-menu-two.png",
        "alt": "Golden Flavors branding case study",
        "pdf": "./img/pdfs/gf_pdf/gf_menu_2.pdf",
        "caption": "Menu Graphic 2"
      }
    ],
    "dates": "May 2021 - Nov 2021",
    "links": [""]
  }
]
